export interface RefineTable {
  baseProb: number;
  amount: Record<string, number>;
  breath: Record<string, [number, number]>;
}

export const refineData: Record<
  string,
  Record<string, Record<number, RefineTable>>
> = {
  armor: {
    t3_1302: {
      7: {
        baseProb: 0.6,
        amount: {
          수결: 78,
          명돌: 2,
          하급오레하: 1,
          파편: 21,
          골드: 110,
        },
        breath: {
          재봉술기본: [1, 0.1],
          은총: [12, 0.0167],
          축복: [6, 0.0333],
          가호: [2, 0.1],
        },
      },
      8: {
        baseProb: 0.45,
        amount: {
          수결: 78,
          명돌: 2,
          하급오레하: 1,
          파편: 21,
          골드: 110,
        },
        breath: {
          재봉술기본: [1, 0.1],
          은총: [12, 0.0125],
          축복: [6, 0.025],
          가호: [2, 0.075],
        },
      },
      9: {
        baseProb: 0.3,
        amount: {
          수결: 78,
          명돌: 2,
          하급오레하: 1,
          파편: 21,
          골드: 110,
        },
        breath: {
          재봉술기본: [1, 0.1],
          은총: [12, 0.0084],
          축복: [6, 0.0167],
          가호: [2, 0.05],
        },
      },
      10: {
        baseProb: 0.3,
        amount: {
          수결: 96,
          명돌: 3,
          하급오레하: 2,
          파편: 25,
          골드: 110,
        },
        breath: {
          재봉술기본: [1, 0.1],
          은총: [12, 0.0084],
          축복: [6, 0.0167],
          가호: [2, 0.05],
        },
      },
      11: {
        baseProb: 0.3,
        amount: {
          수결: 96,
          명돌: 3,
          하급오레하: 2,
          파편: 25,
          골드: 110,
        },
        breath: {
          재봉술기본: [1, 0.1],
          은총: [12, 0.0084],
          축복: [6, 0.0167],
          가호: [2, 0.05],
        },
      },
      12: {
        baseProb: 0.15,
        amount: {
          수결: 96,
          명돌: 3,
          하급오레하: 2,
          파편: 25,
          골드: 110,
        },
        breath: {
          재봉술기본: [1, 0.1],
          은총: [24, 0.0021],
          축복: [12, 0.0042],
          가호: [4, 0.0125],
        },
      },
      13: {
        baseProb: 0.15,
        amount: {
          수결: 114,
          명돌: 3,
          하급오레하: 2,
          파편: 30,
          골드: 110,
        },
        breath: {
          재봉술기본: [1, 0.1],
          은총: [24, 0.0021],
          축복: [12, 0.0042],
          가호: [4, 0.0125],
        },
      },
      14: {
        baseProb: 0.15,
        amount: {
          수결: 114,
          명돌: 4,
          하급오레하: 2,
          파편: 30,
          골드: 110,
        },
        breath: {
          재봉술기본: [1, 0.1],
          은총: [24, 0.0021],
          축복: [12, 0.0042],
          가호: [4, 0.0125],
        },
      },
      15: {
        baseProb: 0.1,
        amount: {
          수결: 114,
          명돌: 4,
          하급오레하: 2,
          파편: 30,
          골드: 110,
        },
        breath: {
          재봉술기본: [1, 0.1],
          은총: [24, 0.0014],
          축복: [12, 0.0028],
          가호: [4, 0.0083],
        },
      },
    },
    t3_1340: {
      7: {
        baseProb: 0.6,
        amount: {
          수결: 162,
          위명돌: 3,
          중급오레하: 2,
          파편: 43,
          골드: 132,
        },
        breath: {
          재봉술응용: [1, 0.1],
          은총: [12, 0.0167],
          축복: [6, 0.0333],
          가호: [2, 0.1],
        },
      },
      8: {
        baseProb: 0.45,
        amount: {
          수결: 162,
          위명돌: 4,
          중급오레하: 2,
          파편: 43,
          골드: 132,
        },
        breath: {
          재봉술응용: [1, 0.1],
          은총: [12, 0.0125],
          축복: [6, 0.025],
          가호: [2, 0.075],
        },
      },
      9: {
        baseProb: 0.3,
        amount: {
          수결: 162,
          위명돌: 4,
          중급오레하: 2,
          파편: 43,
          골드: 132,
        },
        breath: {
          재봉술응용: [1, 0.1],
          은총: [12, 0.0084],
          축복: [6, 0.0167],
          가호: [2, 0.05],
        },
      },
      10: {
        baseProb: 0.3,
        amount: {
          수결: 199,
          위명돌: 4,
          중급오레하: 3,
          파편: 53,
          골드: 132,
        },
        breath: {
          재봉술응용: [1, 0.1],
          은총: [12, 0.0084],
          축복: [6, 0.0167],
          가호: [2, 0.05],
        },
      },
      11: {
        baseProb: 0.3,
        amount: {
          수결: 199,
          위명돌: 4,
          중급오레하: 3,
          파편: 53,
          골드: 132,
        },
        breath: {
          재봉술응용: [1, 0.1],
          은총: [12, 0.0084],
          축복: [6, 0.0167],
          가호: [2, 0.05],
        },
      },
      12: {
        baseProb: 0.15,
        amount: {
          수결: 199,
          위명돌: 5,
          중급오레하: 3,
          파편: 53,
          골드: 132,
        },
        breath: {
          재봉술응용: [1, 0.1],
          은총: [24, 0.0021],
          축복: [12, 0.0042],
          가호: [4, 0.0125],
        },
      },
      13: {
        baseProb: 0.15,
        amount: {
          수결: 237,
          위명돌: 5,
          중급오레하: 3,
          파편: 63,
          골드: 132,
        },
        breath: {
          재봉술응용: [1, 0.1],
          은총: [24, 0.0021],
          축복: [12, 0.0042],
          가호: [4, 0.0125],
        },
      },
      14: {
        baseProb: 0.15,
        amount: {
          수결: 237,
          위명돌: 5,
          중급오레하: 3,
          파편: 63,
          골드: 132,
        },
        breath: {
          재봉술응용: [1, 0.1],
          은총: [24, 0.0021],
          축복: [12, 0.0042],
          가호: [4, 0.0125],
        },
      },
      15: {
        baseProb: 0.1,
        amount: {
          수결: 237,
          위명돌: 5,
          중급오레하: 3,
          파편: 63,
          골드: 140,
        },
        breath: {
          재봉술응용: [1, 0.1],
          은총: [24, 0.0014],
          축복: [12, 0.0028],
          가호: [4, 0.0083],
        },
      },
      16: {
        baseProb: 0.1,
        amount: {
          수결: 686,
          위명돌: 14,
          중급오레하: 10,
          파편: 216,
          골드: 350,
        },
        breath: {
          재봉술심화: [1, 0.1],
          은총: [24, 0.0014],
          축복: [12, 0.0028],
          가호: [4, 0.0083],
        },
      },
      17: {
        baseProb: 0.1,
        amount: {
          수결: 686,
          위명돌: 16,
          중급오레하: 10,
          파편: 292,
          골드: 350,
        },
        breath: {
          재봉술심화: [1, 0.1],
          은총: [24, 0.0014],
          축복: [12, 0.0028],
          가호: [4, 0.0083],
        },
      },
      18: {
        baseProb: 0.05,
        amount: {
          수결: 686,
          위명돌: 16,
          중급오레하: 12,
          파편: 396,
          골드: 350,
        },
        breath: {
          재봉술심화: [1, 0.05],
          은총: [36, 0.0005],
          축복: [18, 0.0009],
          가호: [6, 0.0028],
        },
      },
      19: {
        baseProb: 0.05,
        amount: {
          수결: 780,
          위명돌: 18,
          중급오레하: 14,
          파편: 536,
          골드: 350,
        },
        breath: {
          재봉술심화: [1, 0.05],
          은총: [36, 0.0005],
          축복: [18, 0.0009],
          가호: [6, 0.0028],
        },
      },
      20: {
        baseProb: 0.03,
        amount: {
          수결: 780,
          위명돌: 20,
          중급오레하: 14,
          파편: 728,
          골드: 350,
        },
        breath: {
          재봉술심화: [1, 0.03],
          은총: [36, 0.0003],
          축복: [18, 0.0006],
          가호: [6, 0.0017],
        },
      },
      21: {
        baseProb: 0.03,
        amount: {
          수결: 780,
          위명돌: 22,
          중급오레하: 16,
          파편: 988,
          골드: 360,
        },
        breath: {
          은총: [36, 0.0003],
          축복: [18, 0.0006],
          가호: [6, 0.0017],
        },
      },
      22: {
        baseProb: 0.01,
        amount: {
          수결: 874,
          위명돌: 24,
          중급오레하: 18,
          파편: 1340,
          골드: 380,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0004],
        },
      },
      23: {
        baseProb: 0.01,
        amount: {
          수결: 874,
          위명돌: 26,
          중급오레하: 20,
          파편: 1818,
          골드: 390,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0004],
        },
      },
      24: {
        baseProb: 0.005,
        amount: {
          수결: 874,
          위명돌: 28,
          중급오레하: 22,
          파편: 2466,
          골드: 400,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0004],
        },
      },
      25: {
        baseProb: 0.005,
        amount: {
          수결: 968,
          위명돌: 30,
          중급오레하: 24,
          파편: 3346,
          골드: 420,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0004],
        },
      },
    },
    t3_1390: {
      12: {
        baseProb: 0.1,
        amount: {
          수호강석: 390,
          경명돌: 11,
          상급오레하: 5,
          파편: 600,
          골드: 480,
        },
        breath: {
          은총: [24, 0.0014],
          축복: [12, 0.0028],
          가호: [4, 0.0083],
        },
      },
      13: {
        baseProb: 0.1,
        amount: {
          수호강석: 390,
          경명돌: 11,
          상급오레하: 5,
          파편: 600,
          골드: 480,
        },
        breath: {
          은총: [24, 0.0014],
          축복: [12, 0.0028],
          가호: [4, 0.0083],
        },
      },
      14: {
        baseProb: 0.05,
        amount: {
          수호강석: 420,
          경명돌: 12,
          상급오레하: 7,
          파편: 840,
          골드: 520,
        },
        breath: {
          은총: [36, 0.0005],
          축복: [18, 0.0009],
          가호: [6, 0.0028],
        },
      },
      15: {
        baseProb: 0.05,
        amount: {
          수호강석: 450,
          경명돌: 12,
          상급오레하: 7,
          파편: 840,
          골드: 560,
        },
        breath: {
          은총: [36, 0.0005],
          축복: [18, 0.0009],
          가호: [6, 0.0028],
        },
      },
      16: {
        baseProb: 0.04,
        amount: {
          수호강석: 540,
          경명돌: 13,
          상급오레하: 7,
          파편: 1440,
          골드: 670,
        },
        breath: {
          은총: [36, 0.0004],
          축복: [18, 0.0007],
          가호: [6, 0.0022],
        },
      },
      17: {
        baseProb: 0.04,
        amount: {
          수호강석: 570,
          경명돌: 14,
          상급오레하: 7,
          파편: 1440,
          골드: 720,
        },
        breath: {
          은총: [36, 0.0004],
          축복: [18, 0.0007],
          가호: [6, 0.0022],
        },
      },
      18: {
        baseProb: 0.03,
        amount: {
          수호강석: 660,
          경명돌: 17,
          상급오레하: 12,
          파편: 2160,
          골드: 810,
        },
        breath: {
          은총: [36, 0.0003],
          축복: [18, 0.0006],
          가호: [6, 0.0017],
        },
      },
      19: {
        baseProb: 0.03,
        amount: {
          수호강석: 690,
          경명돌: 18,
          상급오레하: 12,
          파편: 2160,
          골드: 860,
        },
        breath: {
          은총: [36, 0.0003],
          축복: [18, 0.0006],
          가호: [6, 0.0017],
        },
      },
      20: {
        baseProb: 0.015,
        amount: {
          수호강석: 780,
          경명돌: 19,
          상급오레하: 18,
          파편: 3000,
          골드: 960,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0007],
        },
      },
      21: {
        baseProb: 0.015,
        amount: {
          수호강석: 810,
          경명돌: 20,
          상급오레하: 18,
          파편: 3960,
          골드: 1020,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0007],
        },
      },
      22: {
        baseProb: 0.01,
        amount: {
          수호강석: 900,
          경명돌: 23,
          상급오레하: 18,
          파편: 5040,
          골드: 1130,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0004],
        },
      },
      23: {
        baseProb: 0.01,
        amount: {
          수호강석: 930,
          경명돌: 25,
          상급오레하: 18,
          파편: 6000,
          골드: 1200,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0004],
        },
      },
      24: {
        baseProb: 0.005,
        amount: {
          수호강석: 1020,
          경명돌: 26,
          상급오레하: 27,
          파편: 7200,
          골드: 1350,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0004],
        },
      },
      25: {
        baseProb: 0.005,
        amount: {
          수호강석: 1050,
          경명돌: 29,
          상급오레하: 27,
          파편: 8640,
          골드: 1470,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0004],
        },
      },
    },
  },
  weapon: {
    t3_1302: {
      7: {
        baseProb: 0.6,
        amount: {
          파결: 129,
          명돌: 4,
          하급오레하: 2,
          파편: 30,
          골드: 200,
        },
        breath: {
          야금술기본: [1, 0.1],
          은총: [12, 0.0167],
          축복: [6, 0.0333],
          가호: [2, 0.1],
        },
      },
      8: {
        baseProb: 0.45,
        amount: {
          파결: 129,
          명돌: 4,
          하급오레하: 2,
          파편: 30,
          골드: 200,
        },
        breath: {
          야금술기본: [1, 0.1],
          은총: [12, 0.0125],
          축복: [6, 0.025],
          가호: [2, 0.075],
        },
      },
      9: {
        baseProb: 0.3,
        amount: {
          파결: 129,
          명돌: 4,
          하급오레하: 2,
          파편: 30,
          골드: 200,
        },
        breath: {
          야금술기본: [1, 0.1],
          은총: [12, 0.0084],
          축복: [6, 0.0167],
          가호: [2, 0.05],
        },
      },
      10: {
        baseProb: 0.3,
        amount: {
          파결: 160,
          명돌: 5,
          하급오레하: 2,
          파편: 37,
          골드: 200,
        },
        breath: {
          야금술기본: [1, 0.1],
          은총: [12, 0.0084],
          축복: [6, 0.0167],
          가호: [2, 0.05],
        },
      },
      11: {
        baseProb: 0.3,
        amount: {
          파결: 160,
          명돌: 5,
          하급오레하: 2,
          파편: 37,
          골드: 200,
        },
        breath: {
          야금술기본: [1, 0.1],
          은총: [12, 0.0084],
          축복: [6, 0.0167],
          가호: [2, 0.05],
        },
      },
      12: {
        baseProb: 0.15,
        amount: {
          파결: 160,
          명돌: 5,
          하급오레하: 2,
          파편: 37,
          골드: 200,
        },
        breath: {
          야금술기본: [1, 0.1],
          은총: [24, 0.0021],
          축복: [12, 0.0042],
          가호: [4, 0.0125],
        },
      },
      13: {
        baseProb: 0.15,
        amount: {
          파결: 190,
          명돌: 5,
          하급오레하: 3,
          파편: 44,
          골드: 200,
        },
        breath: {
          야금술기본: [1, 0.1],
          은총: [24, 0.0021],
          축복: [12, 0.0042],
          가호: [4, 0.0125],
        },
      },
      14: {
        baseProb: 0.15,
        amount: {
          파결: 190,
          명돌: 5,
          하급오레하: 3,
          파편: 44,
          골드: 200,
        },
        breath: {
          야금술기본: [1, 0.1],
          은총: [24, 0.0021],
          축복: [12, 0.0042],
          가호: [4, 0.0125],
        },
      },
      15: {
        baseProb: 0.1,
        amount: {
          파결: 190,
          명돌: 5,
          하급오레하: 3,
          파편: 44,
          골드: 200,
        },
        breath: {
          야금술기본: [1, 0.1],
          은총: [24, 0.0014],
          축복: [12, 0.0028],
          가호: [4, 0.0083],
        },
      },
    },
    t3_1340: {
      7: {
        baseProb: 0.6,
        amount: {
          파결: 269,
          위명돌: 5,
          중급오레하: 2,
          파편: 62,
          골드: 256,
        },
        breath: {
          야금술응용: [1, 0.1],
          은총: [12, 0.0167],
          축복: [6, 0.0333],
          가호: [2, 0.1],
        },
      },
      8: {
        baseProb: 0.45,
        amount: {
          파결: 269,
          위명돌: 6,
          중급오레하: 2,
          파편: 62,
          골드: 256,
        },
        breath: {
          야금술응용: [1, 0.1],
          은총: [12, 0.0125],
          축복: [6, 0.025],
          가호: [2, 0.075],
        },
      },
      9: {
        baseProb: 0.3,
        amount: {
          파결: 269,
          위명돌: 6,
          중급오레하: 3,
          파편: 62,
          골드: 256,
        },
        breath: {
          야금술응용: [1, 0.1],
          은총: [12, 0.0084],
          축복: [6, 0.0167],
          가호: [2, 0.05],
        },
      },
      10: {
        baseProb: 0.3,
        amount: {
          파결: 332,
          위명돌: 6,
          중급오레하: 3,
          파편: 77,
          골드: 256,
        },
        breath: {
          야금술응용: [1, 0.1],
          은총: [12, 0.0084],
          축복: [6, 0.0167],
          가호: [2, 0.05],
        },
      },
      11: {
        baseProb: 0.3,
        amount: {
          파결: 332,
          위명돌: 6,
          중급오레하: 3,
          파편: 77,
          골드: 264,
        },
        breath: {
          야금술응용: [1, 0.1],
          은총: [12, 0.0084],
          축복: [6, 0.0167],
          가호: [2, 0.05],
        },
      },
      12: {
        baseProb: 0.15,
        amount: {
          파결: 332,
          위명돌: 7,
          중급오레하: 3,
          파편: 77,
          골드: 264,
        },
        breath: {
          야금술응용: [1, 0.1],
          은총: [24, 0.0021],
          축복: [12, 0.0042],
          가호: [4, 0.0125],
        },
      },
      13: {
        baseProb: 0.15,
        amount: {
          파결: 394,
          위명돌: 7,
          중급오레하: 4,
          파편: 91,
          골드: 264,
        },
        breath: {
          야금술응용: [1, 0.1],
          은총: [24, 0.0021],
          축복: [12, 0.0042],
          가호: [4, 0.0125],
        },
      },
      14: {
        baseProb: 0.15,
        amount: {
          파결: 394,
          위명돌: 8,
          중급오레하: 4,
          파편: 91,
          골드: 264,
        },
        breath: {
          야금술응용: [1, 0.1],
          은총: [24, 0.0021],
          축복: [12, 0.0042],
          가호: [4, 0.0125],
        },
      },
      15: {
        baseProb: 0.1,
        amount: {
          파결: 394,
          위명돌: 8,
          중급오레하: 4,
          파편: 91,
          골드: 264,
        },
        breath: {
          야금술응용: [1, 0.1],
          은총: [24, 0.0014],
          축복: [12, 0.0028],
          가호: [4, 0.0083],
        },
      },
      16: {
        baseProb: 0.1,
        amount: {
          파결: 1144,
          위명돌: 22,
          중급오레하: 12,
          파편: 310,
          골드: 680,
        },
        breath: {
          야금술심화: [1, 0.1],
          은총: [24, 0.0014],
          축복: [12, 0.0028],
          가호: [4, 0.0083],
        },
      },
      17: {
        baseProb: 0.1,
        amount: {
          파결: 1144,
          위명돌: 24,
          중급오레하: 14,
          파편: 422,
          골드: 680,
        },
        breath: {
          야금술심화: [1, 0.1],
          은총: [24, 0.0014],
          축복: [12, 0.0028],
          가호: [4, 0.0083],
        },
      },
      18: {
        baseProb: 0.05,
        amount: {
          파결: 1144,
          위명돌: 28,
          중급오레하: 16,
          파편: 572,
          골드: 680,
        },
        breath: {
          야금술심화: [1, 0.05],
          은총: [36, 0.0005],
          축복: [18, 0.0009],
          가호: [6, 0.0028],
        },
      },
      19: {
        baseProb: 0.05,
        amount: {
          파결: 1300,
          위명돌: 30,
          중급오레하: 18,
          파편: 776,
          골드: 710,
        },
        breath: {
          야금술심화: [1, 0.05],
          은총: [36, 0.0005],
          축복: [18, 0.0009],
          가호: [6, 0.0028],
        },
      },
      20: {
        baseProb: 0.03,
        amount: {
          파결: 1300,
          위명돌: 32,
          중급오레하: 20,
          파편: 1054,
          골드: 730,
        },
        breath: {
          야금술심화: [1, 0.03],
          은총: [36, 0.0003],
          축복: [18, 0.0006],
          가호: [6, 0.0017],
        },
      },
      21: {
        baseProb: 0.03,
        amount: {
          파결: 1300,
          위명돌: 34,
          중급오레하: 22,
          파편: 1432,
          골드: 750,
        },
        breath: {
          은총: [36, 0.0003],
          축복: [18, 0.0006],
          가호: [6, 0.0017],
        },
      },
      22: {
        baseProb: 0.01,
        amount: {
          파결: 1458,
          위명돌: 38,
          중급오레하: 26,
          파편: 1944,
          골드: 780,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0004],
        },
      },
      23: {
        baseProb: 0.01,
        amount: {
          파결: 1458,
          위명돌: 42,
          중급오레하: 28,
          파편: 2640,
          골드: 810,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0004],
        },
      },
      24: {
        baseProb: 0.005,
        amount: {
          파결: 1458,
          위명돌: 44,
          중급오레하: 32,
          파편: 3586,
          골드: 840,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0004],
        },
      },
      25: {
        baseProb: 0.005,
        amount: {
          파결: 1615,
          위명돌: 48,
          중급오레하: 36,
          파편: 4868,
          골드: 870,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0004],
        },
      },
    },
    t3_1390: {
      12: {
        baseProb: 0.1,
        amount: {
          파괴강석: 650,
          경명돌: 18,
          상급오레하: 8,
          파편: 1000,
          골드: 800,
        },
        breath: {
          은총: [24, 0.0014],
          축복: [12, 0.0028],
          가호: [4, 0.0083],
        },
      },
      13: {
        baseProb: 0.1,
        amount: {
          파괴강석: 650,
          경명돌: 18,
          상급오레하: 8,
          파편: 1000,
          골드: 800,
        },
        breath: {
          은총: [24, 0.0014],
          축복: [12, 0.0028],
          가호: [4, 0.0083],
        },
      },
      14: {
        baseProb: 0.05,
        amount: {
          파괴강석: 700,
          경명돌: 20,
          상급오레하: 12,
          파편: 1400,
          골드: 870,
        },
        breath: {
          은총: [36, 0.0005],
          축복: [18, 0.0009],
          가호: [6, 0.0028],
        },
      },
      15: {
        baseProb: 0.05,
        amount: {
          파괴강석: 750,
          경명돌: 20,
          상급오레하: 12,
          파편: 1400,
          골드: 940,
        },
        breath: {
          은총: [36, 0.0005],
          축복: [18, 0.0009],
          가호: [6, 0.0028],
        },
      },
      16: {
        baseProb: 0.04,
        amount: {
          파괴강석: 900,
          경명돌: 22,
          상급오레하: 12,
          파편: 2400,
          골드: 1120,
        },
        breath: {
          은총: [36, 0.0004],
          축복: [18, 0.0007],
          가호: [6, 0.0022],
        },
      },
      17: {
        baseProb: 0.04,
        amount: {
          파괴강석: 950,
          경명돌: 24,
          상급오레하: 12,
          파편: 2400,
          골드: 1200,
        },
        breath: {
          은총: [36, 0.0004],
          축복: [18, 0.0007],
          가호: [6, 0.0022],
        },
      },
      18: {
        baseProb: 0.03,
        amount: {
          파괴강석: 1100,
          경명돌: 28,
          상급오레하: 20,
          파편: 3600,
          골드: 1350,
        },
        breath: {
          은총: [36, 0.0003],
          축복: [18, 0.0006],
          가호: [6, 0.0017],
        },
      },
      19: {
        baseProb: 0.03,
        amount: {
          파괴강석: 1150,
          경명돌: 30,
          상급오레하: 20,
          파편: 3600,
          골드: 1440,
        },
        breath: {
          은총: [36, 0.0003],
          축복: [18, 0.0006],
          가호: [6, 0.0017],
        },
      },
      20: {
        baseProb: 0.015,
        amount: {
          파괴강석: 1300,
          경명돌: 32,
          상급오레하: 30,
          파편: 5000,
          골드: 1600,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0007],
        },
      },
      21: {
        baseProb: 0.015,
        amount: {
          파괴강석: 1350,
          경명돌: 34,
          상급오레하: 30,
          파편: 6600,
          골드: 1700,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0007],
        },
      },
      22: {
        baseProb: 0.01,
        amount: {
          파괴강석: 1500,
          경명돌: 38,
          상급오레하: 30,
          파편: 8400,
          골드: 1880,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0004],
        },
      },
      23: {
        baseProb: 0.01,
        amount: {
          파괴강석: 1550,
          경명돌: 42,
          상급오레하: 30,
          파편: 10000,
          골드: 2000,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0004],
        },
      },
      24: {
        baseProb: 0.005,
        amount: {
          파괴강석: 1700,
          경명돌: 44,
          상급오레하: 45,
          파편: 12000,
          골드: 2250,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0004],
        },
      },
      25: {
        baseProb: 0.005,
        amount: {
          파괴강석: 1750,
          경명돌: 48,
          상급오레하: 45,
          파편: 14400,
          골드: 2450,
        },
        breath: {
          은총: [48, 0.0001],
          축복: [24, 0.0002],
          가호: [8, 0.0004],
        },
      },
    },
  },
};

export function getTargetList(
  itemType: string | undefined,
  itemGrade: string | undefined
) {
  if (!itemType || !itemGrade) {
    return [];
  }
  return Object.keys(refineData[itemType][itemGrade]).map((x) => +x);
}

export function getRefineTable(
  itemType: string | undefined,
  itemGrade: string | undefined,
  refineTarget: number | undefined
) {
  if (!itemType || !itemGrade || !refineTarget) {
    return undefined;
  }
  return refineData[itemType][itemGrade][refineTarget];
}
